spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/makes_a_card_declined_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=12&card[exp_year]=2016&card[cvc]=666
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_yeB2iv7u3JIgUtNZPSxb0R7Z
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.11.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        mini.home 13.1.0 Darwin Kernel Version 13.1.0: Wed Apr  2 23:52:02 PDT 2014;
        root:xnu-2422.92.1~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 18 May 2014 21:44:26 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '571'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1043jY4Lt6GZHN3Ukz5J4cvp",
          "livemode": false,
          "created": 1400449466,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_1043jY4Lt6GZHN3UcWzl2Fr2",
            "object": "card",
            "last4": "0002",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2016,
            "fingerprint": "FmaALamhZpN3caic",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Sun, 18 May 2014 21:46:49 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=400&card=tok_1043jY4Lt6GZHN3Ukz5J4cvp&currency=usd&description=An%20invalid%20charge
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_yeB2iv7u3JIgUtNZPSxb0R7Z
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.11.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        mini.home 13.1.0 Darwin Kernel Version 13.1.0: Wed Apr  2 23:52:02 PDT 2014;
        root:xnu-2422.92.1~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '91'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sun, 18 May 2014 21:44:27 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '162'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_1043jY4Lt6GZHN3U5EGna1D1"
          }
        }
    http_version: 
  recorded_at: Sun, 18 May 2014 21:46:50 GMT
recorded_with: VCR 2.9.0
